/**
 * Created by wanglei07 on 2016/9/14.
 */
var app = angular.module('gfbApp');

app.controller('HelpCenterCtrl',function($routeParams,$scope,$rootScope,$location,$timeout,ngUtils,UserInfo,Constant,$resource,IdentityService){
	var token=$routeParams.xAuthToken;
	
	//跳转到吐槽页面
	$scope.toCustomerComments = function() {
	    $location.url("/customerComment");
	}
	
	//返回订单页面
	$scope.goBackOrder = function() {
		var token=window.localStorage.getItem("x-auth-token");
		$location.url("/order?xAuthToken="+token);
	}
	
	//联系客服
	$scope.showServiceCenter = function() {
		$scope.serCenShow = false;
	}

    /*问题列表*/
	 $scope.expanders = [{
	        title : '安家派是放款到哪个账户，多久到账？',
	        text : '安家派是放款到您绑定的银行卡中，一般审核通过后一个工作日左右到账。'
	    }, {
	        title : '安家派可以短期借贷吗？',
	        text : '安家派的贷款期限目前有：3、6、9、12期，由您自由选择贷款期限。'
	    }, {
	        title : '安家派可以放款到哪些银行卡？',
	        text : '安家派目前支持的银行有建设银行、工商银行、农业银行、中国银行、招商银行、光大银行、民生银行、广发银行、平安银行、中信银行、兴业银行。其他银行正在接入中•••••'
	    }, {
	        title : '安家派的利率是多少？',
	        text : '安家派的利率是根据您的个人信用等情况进行综合评估后设定，若有利率调整需求，建议您继续保持良好的信用和还款记录，由系统评估设定，人工无法为您操作调整，最低日利率低至万分之二，实际利率请以合同显示为准。'
	    }, {
	        title : '安家派的额度是多少？',
	        text : '安家派的额度是由系统根据您的个人信用情况综合评估，额度区间为1000-30000元，若当前无可用额度或额度较低，请您保持良好的个人信用和还款记录，为后续您的提额及参加各种活动做准备。'
	    }, {
	        title : '安家派的登录密码忘记了？',
	        text : '登录页面，点击右小角的忘记密码四个小字，即可通过注册手机号码的短信验证码找回。'
	    }, {
	        title : '安家派的交易密码忘记了',
	        text : '登录app后，点击最下方的【我的】-【密码管理】-【交易密码】，即可通过身份验证找回。'
	    }, {
	        title : '还款时间和扣款方式？',
	        text : '您好，请在最后还款日当天晚上十二点之前将应还金额存入到您绑定的银行卡中，存入后，保持卡里资金不动，系统会在还款日的后一天凌晨零点，开始自动扣款。'
	    }, {
	        title : '一次还清贷款利息怎么算？',
	        text : '安家派享有7天免息期，到账7日内（含放款日当天），全额还款免收利息和清贷服务费，放款到账超过7天，一次还清，利息截止到全额还款日当天，利息按天计算。'
	    }, {
	        title : '最后还款日和每期账单金额如何查看？',
	        text : '登录安家派app，首页左上角，点击账单，即可查看。'
	    }, {
	        title : '还款日期可以修改吗？',
	        text : '还款日与您收到借款的时间相关，目前暂不支持修改，具体以合同及app账单页面显示为准。但您可以根据您的实际需求进行一次还清或者提前还当期账单。'
	    }, {
	        title : '身份证上传失败',
	        text : '请按照以下要求重新上传您的身份证照片：1.更换角度拍摄，确保满屏拍摄证件照，无过多空白，拍摄背景尽量选择深色背景；2.请保证身份证信息清晰可见，避免光亮（反光）或阴影使身份证信息无法辨认，原图上传；3.请选择信号网络良好的环境内操作。'
	    }, {
	        title : '手机认证失败',
	        text : '请确认您输入的手机号码为您本人所有并已通过实名认证。若您确认本人手机已实名认证但系统仍提示认证失败，有可能是手机运营商问题，可联系运营商进行咨询。'
	    }, {
	        title : '手机验证时间过长？',
	        text : '系统正在获取用户手机实名信息中，可能是运营商网络原因造成迟缓，请耐心等待一下。'
	    }
	    ];
});
